[
    {
        "Category":  "joke",
        "text":  "I put my phone on airplane mode, but it sure ain\u0027t flyin\u0027. "
    },
    {
        "Category":  "joke",
        "text":  "Q. Why are conspiracy theories are like moon landings?\r\nA. Because they\u0027re all fake. "
    },
    {
        "Category":  "joke",
        "text":  "Do not be racist; be like Mario. He\u0027s an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew! "
    },
    {
        "Category":  "joke",
        "text":  "Yo momma is so fat, when she sat on an iPod, she made the iPad! "
    },
    {
        "Category":  "joke",
        "text":  "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, \"And what starting salary are you looking for?\" The engineer replies, \"In the region of $125,000 a year, depending on the benefits package.\" The interviewer inquires, \"Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?\" The engineer sits up straight and says, \"Wow! Are you kidding?\" The interviewer replies, \"Yeah, but you started it.\" "
    },
    {
        "Category":  "joke",
        "text":  "Q: Why couldn\u0027t the blonde add 10 + 5 on a calculator? \r\nA: She couldn\u0027t find the \"10\" button. "
    },
    {
        "Category":  "joke",
        "text":  "Your momma is so stupid she put airbags on her computer in case it crashed. "
    },
    {
        "Category":  "joke",
        "text":  "Yo momma so fat when she registered for MySpace there was no space left. "
    },
    {
        "Category":  "joke",
        "text":  "I named my hard drive \"dat ass,\" so once a month my computer asks if I want to \"back dat ass up.\" "
    },
    {
        "Category":  "joke",
        "text":  "Q: What do computers eat for a snack? \r\nA: Microchips! "
    },
    {
        "Category":  "joke",
        "text":  "Mother: \"Sweetie, make a Christmas wish.\" \r\nGirl: \"I wish that Santa will send some clothes to those naked girls in papa\u0027s computer.\" "
    },
    {
        "Category":  "joke",
        "text":  "The energizer bunny was arrested on a charge of battery. "
    },
    {
        "Category":  "joke",
        "text":  "Q: What computer sings the best? \r\nA: A Dell. "
    },
    {
        "Category":  "joke",
        "text":  "Q: What\u0027s Forrest GumpΓ??s password? \r\nA: 1forrest1 "
    },
    {
        "Category":  "joke",
        "text":  "Q: How can you tell if a blonde used a computer? \r\nA: There\u0027s Wite-Out all over the screen. "
    },
    {
        "Category":  "joke",
        "text":  "Q: What did the spider do on the computer? \r\nA: Made a website! "
    },
    {
        "Category":  "joke",
        "text":  "What does an air conditioner have in common with a computer? They both lose efficiency as soon as you open windows. "
    },
    {
        "Category":  "joke",
        "text":  "Me: Siri, where is the best place to hide a body?\r\nSiri: The second page of a Google search. "
    },
    {
        "Category":  "joke",
        "text":  "Three guys are sitting in a sauna: a Mexican, an Asian, and a white guy. The Mexican and white guy are showing off their new tech gadgets. The white guy says, \"Hey, look what I got: the new Google Glass!\" The Mexican \u0026 Asian say, \"Wow, that\u0027s nice, man.\" Then the Mexican guy says, \"Check out my new cellphone; it\u0027s a watch!\" The white guy and Asian say, \"Very cool, dude.\" The Asian guy has nothing to show these guys, so he gets up and walks away naked to to the bathroom. Then he comes back 5 minutes later from the bathroom still naked with paper hanging out of his butt crack. The Mexican and white guy say, \"Hey, you have something hanging out of your ass.\" The Asian guy says, \"Oh look, I\u0027m receiving a Fax!\" "
    },
    {
        "Category":  "joke",
        "text":  "Q: What did the computer do at lunchtime?\r\nA: Had a byte! "
    },
    {
        "Category":  "joke",
        "text":  "Does anyone remember the Swatch, a watch made in Switzerland? Thank god Croatia didn\u0027t come up with the idea first. Just imagine if someone were to ask you what time is it? \"Oh pardon me while I look at my crotch.\" "
    },
    {
        "Category":  "joke",
        "text":  "I decided to make my password \"incorrect\" because if I type it in wrong, my computer will remind me, \"Your password is incorrect.\" "
    },
    {
        "Category":  "joke",
        "text":  "Yo mamma is so fat that when she sat on a laptop, the hardware turned into software! "
    },
    {
        "Category":  "joke",
        "text":  "Q: How many light bulbs does it take to change a light bulb? A: They can\u0027t; they\u0027re not bright enough. "
    },
    {
        "Category":  "joke",
        "text":  "Q: How easy is it to count in binary? \r\nA: ItΓ??s as easy as 01 10 11. "
    },
    {
        "Category":  "joke",
        "text":  "Q: Why shouldn\u0027t Facebook have paid $1 billion dollars for Instagram? \r\nA: They could\u0027ve downloaded it for free! "
    },
    {
        "Category":  "joke",
        "text":  "Did you hear about the guy whose whole left side was cut off? He\u0027s all right now."
    },
    {
        "Category":  "joke",
        "text":  "I\u0027m reading a book about anti-gravity. It\u0027s impossible to put down."
    },
    {
        "Category":  "joke",
        "text":  "I wondered why the baseball was getting bigger. Then it hit me."
    },
    {
        "Category":  "joke",
        "text":  "It\u0027s not that the man did not know how to juggle, he just didn\u0027t have the balls to do it."
    },
    {
        "Category":  "joke",
        "text":  "I\u0027m glad I know sign language, it\u0027s pretty handy."
    },
    {
        "Category":  "joke",
        "text":  "My friend\u0027s bakery burned down last night. Now his business is toast."
    },
    {
        "Category":  "joke",
        "text":  "Why did the cookie cry? It was feeling crumby."
    },
    {
        "Category":  "joke",
        "text":  "I used to be a banker, but I lost interest."
    },
    {
        "Category":  "joke",
        "text":  "A drum and a symbol fall off a cliff"
    },
    {
        "Category":  "joke",
        "text":  "Why do seagulls fly over the sea? Because they aren\u0027t bay-gulls!"
    },
    {
        "Category":  "joke",
        "text":  "Why did the fireman wear red, white, and blue suspenders? To hold his pants up."
    },
    {
        "Category":  "joke",
        "text":  "Why didn\u0027t the crab share his food? Because crabs are territorial animals, that don\u0027t share anything."
    },
    {
        "Category":  "joke",
        "text":  "Why was the javascript developer sad? Because he didn\u0027t Node how to Express himself."
    },
    {
        "Category":  "joke",
        "text":  "What do I look like? A JOKE MACHINE!?"
    },
    {
        "Category":  "joke",
        "text":  "How did the hipster burn the roof of his mouth? He ate the pizza before it was cool."
    },
    {
        "Category":  "joke",
        "text":  "Why is it hard to make puns for kleptomaniacs? They are always taking things literally."
    },
    {
        "Category":  "joke",
        "text":  "Why do mermaid wear sea-shells? Because b-shells are too small."
    },
    {
        "Category":  "joke",
        "text":  "I\u0027m a humorless, cold hearted, machine."
    },
    {
        "Category":  "joke",
        "text":  "Two fish in a tank. One looks to the other and says \u0027Can you even drive this thing???\u0027"
    },
    {
        "Category":  "joke",
        "text":  "Two fish swim down a river, and hit a wall. One says: \u0027Dam!\u0027"
    },
    {
        "Category":  "joke",
        "text":  "What\u0027s funnier than a monkey dancing with an elephant? Two monkeys dancing with an elephant."
    },
    {
        "Category":  "joke",
        "text":  "How did Darth Vader know what Luke was getting for Christmas? He felt his presents."
    },
    {
        "Category":  "joke",
        "text":  "What\u0027s red and bad for your teeth? A Brick."
    },
    {
        "Category":  "joke",
        "text":  "What\u0027s orange and sounds like a parrot? A Carrot."
    },
    {
        "Category":  "joke",
        "text":  "What do you call a cow with no legs? Ground beef"
    },
    {
        "Category":  "joke",
        "text":  "Two guys walk into a bar. You\u0027d think the second one would have noticed."
    },
    {
        "Category":  "joke",
        "text":  "What is a centipedes\u0027s favorite Beatle song?  I want to hold your hand, hand, hand, hand..."
    },
    {
        "Category":  "joke",
        "text":  "What do you call a chicken crossing the road? Poultry in moton. "
    },
    {
        "Category":  "joke",
        "text":  "Did you hear about the Mexican train killer?  He had locomotives"
    },
    {
        "Category":  "joke",
        "text":  "What do you call a fake noodle?  An impasta"
    },
    {
        "Category":  "joke",
        "text":  "How many tickles does it take to tickle an octupus? Ten-tickles!"
    },
    {
        "Category":  "joke",
        "text":  "At the rate law schools are turning them out, by 2050 there will be more lawyers than humans."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris uses ribbed condoms inside out, so he gets the pleasure."
    },
    {
        "Category":  "joke",
        "text":  "MacGyver can build an airplane out of gum and paper clips. Chuck Norris can kill him and take it."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t read books. He stares them down until he gets the information he wants."
    },
    {
        "Category":  "joke",
        "text":  "If you ask Chuck Norris what time it is, he always answers \"Two seconds till\". After you ask \"Two seconds to what?\", he roundhouse kicks you in the face."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris lost his virginity before his dad did."
    },
    {
        "Category":  "joke",
        "text":  "Since 1940, the year Chuck Norris was born, roundhouse kick related deaths have increased 13,000 percent."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris sheds his skin twice a year."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once challenged Lance Armstrong in a \"Who has more testicles?\" contest. Chuck Norris won by 5."
    },
    {
        "Category":  "joke",
        "text":  "There are no steroids in baseball. Just players Chuck Norris has breathed on."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris goes to donate blood, he declines the syringe, and instead requests a hand gun and a bucket."
    },
    {
        "Category":  "joke",
        "text":  "Pluto is actually an orbiting group of British soldiers from the American Revolution who entered space after the Chuck gave them a roundhouse kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not teabag the ladies. He potato-sacks them."
    },
    {
        "Category":  "joke",
        "text":  "According to the Encyclopedia Brittanica, the Native American \"Trail of Tears\" has been redefined as anywhere that Chuck Norris walks."
    },
    {
        "Category":  "joke",
        "text":  "In an average living room there are 1,242 objects Chuck Norris could use to kill you, including the room itself."
    },
    {
        "Category":  "joke",
        "text":  "The Chuck Norris military unit was not used in the game Civilization 4, because a single Chuck Norris could defeat the entire combined nations of the world in one turn."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t shower, he only takes blood baths."
    },
    {
        "Category":  "joke",
        "text":  "Time waits for no man. Unless that man is Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can hit you so hard that he can actually alter your DNA. Decades from now your descendants will occasionally clutch their heads and yell \"What The Hell was That?\"."
    },
    {
        "Category":  "joke",
        "text":  "In the Bible, Jesus turned water into wine. But then Chuck Norris turned that wine into beer."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the only human being to display the Heisenberg uncertainty principle - you can never know both exactly where and how quickly he will roundhouse-kick you in the face."
    },
    {
        "Category":  "joke",
        "text":  "Faster than a speeding bullet... More powerful than a locomotive... Able to leap tall buildings in a single bound... These are some of Chuck Norris\u0027s warm-up exercises."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is not hung like a horse. Horses are hung like Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Teenage Mutant Ninja Turtles is based on a true story: Chuck Norris once swallowed a turtle whole, and when he crapped it out, the turtle was six feet tall and had learned karate."
    },
    {
        "Category":  "joke",
        "text":  "Someone once tried to tell Chuck Norris that roundhouse kicks aren\u0027t the best way to kick someone. This has been recorded by historians as the worst mistake anyone has ever made."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has two speeds: Walk and Kill."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once shot down a German fighter plane with his finger. By yelling \"Bang!\""
    },
    {
        "Category":  "joke",
        "text":  "The opening scene of the movie \"Saving Private Ryan\" is loosely based on games of dodgeball Chuck Norris played in second grade."
    },
    {
        "Category":  "joke",
        "text":  "Fool me once, shame on you. Fool Chuck Norris once and he will roundhouse kick you in the face."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris originally appeared in the \"Street Fighter II\" video game, but was removed by Beta Testers because every button caused him to do a roundhouse kick. When asked about this glitch, Norris replied \"That\u0027s no glitch.\""
    },
    {
        "Category":  "joke",
        "text":  "If you spell Chuck Norris in Scrabble, you win. Forever."
    },
    {
        "Category":  "joke",
        "text":  "Someone once videotaped Chuck Norris getting pissed off. It was called Walker: Texas Chain Saw Masacre."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris will attain statehood in 2009. His state flower will be the Magnolia."
    },
    {
        "Category":  "joke",
        "text":  "A handicapped parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t wash his clothes. He disembowels them."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t churn butter. He roundhouse kicks the cows and the butter comes straight out."
    },
    {
        "Category":  "joke",
        "text":  "Police label anyone attacking Chuck Norris as a Code 45-11.... A suicide."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the only man to ever defeat a brick wall in a game of tennis."
    },
    {
        "Category":  "joke",
        "text":  "What was going through the minds of all of Chuck Norris\u0027 victims before they died? His shoe."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once ate three 72 oz. steaks in one hour. He spent the first 45 minutes having sex with his waitress."
    },
    {
        "Category":  "joke",
        "text":  "There is no theory of evolution, just a list of creatures Chuck Norris allows to live."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can win a game of Connect Four in only three moves."
    },
    {
        "Category":  "joke",
        "text":  "CNN was originally created as the \"Chuck Norris Network\" to update Americans with on-the-spot ass kicking in real-time."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris invented Kentucky Fried Chicken\u0027s famous secret recipe with eleven herbs and spices. Nobody ever mentions the twelfth ingredient: Fear."
    },
    {
        "Category":  "joke",
        "text":  "The quickest way to a man\u0027s heart is with Chuck Norris\u0027 fist."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris sends in his taxes, he sends blank forms and includes only a picture of himself, crouched and ready to attack. Chuck Norris has not had to pay taxes, ever."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris drives an ice cream truck covered in human skulls."
    },
    {
        "Category":  "joke",
        "text":  "Most people have 23 pairs of chromosomes. Chuck Norris has 72... and they\u0027re all poisonous."
    },
    {
        "Category":  "joke",
        "text":  "The Great Wall of China was originally created to keep Chuck Norris out. It failed miserably."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is ten feet tall, weighs two-tons, breathes fire, and could eat a hammer and take a shotgun blast standing."
    },
    {
        "Category":  "joke",
        "text":  "Crop circles are Chuck Norris\u0027 way of telling the world that sometimes corn needs to lie down."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once roundhouse kicked someone so hard that his foot broke the speed of light, went back in time, and killed Amelia Earhart while she was flying over the Pacific Ocean."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris calls 1-900 numbers, he doesn\u0027t get charged. He holds up the phone and money falls out."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once ate a whole cake before his friends could tell him there was a stripper in it."
    },
    {
        "Category":  "joke",
        "text":  "Some people like to eat frogs\u0027 legs. Chuck Norris likes to eat lizard legs. Hence, snakes."
    },
    {
        "Category":  "joke",
        "text":  "There are no races, only countries of people Chuck Norris has beaten to different shades of black and blue."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris was denied an Egg McMuffin at McDonald\u0027s because it was 10:35, he roundhouse kicked the store so hard it became a Wendy\u0027s."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can\u0027t finish a \"color by numbers\" because his markers are filled with the blood of his victims. Unfortunately, all blood is dark red."
    },
    {
        "Category":  "joke",
        "text":  "A Chuck Norris-delivered Roundhouse Kick is the preferred method of execution in 16 states."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris falls in water, Chuck Norris doesn\u0027t get wet. Water gets Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Scientists have estimated that the energy given off during the Big Bang is roughly equal to 1CNRhK (Chuck Norris Roundhouse Kick)."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 house has no doors, only walls that he walks through."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris has sex with a man, it won\u0027t be because he is gay. It will be because he has run out of women."
    },
    {
        "Category":  "joke",
        "text":  "How much wood would a woodchuck chuck if a woodchuck could Chuck Norris? All of it."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t actually write books, the words assemble themselves out of fear."
    },
    {
        "Category":  "joke",
        "text":  "In honor of Chuck Norris, all McDonald\u0027s in Texas have an even larger size than the super-size. When ordering, just ask to be Chucksized."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can believe it\u0027s not butter."
    },
    {
        "Category":  "joke",
        "text":  "If tapped, a Chuck Norris roundhouse kick could power the country of Australia for 44 minutes."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can divide by zero."
    },
    {
        "Category":  "joke",
        "text":  "The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears."
    },
    {
        "Category":  "joke",
        "text":  "Newton\u0027s Third Law is wrong: Although it states that for each action, there is an equal and opposite reaction, there is no force equal in reaction to a Chuck Norris roundhouse kick."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris invented his own type of karate. It\u0027s called Chuck-Will-Kill."
    },
    {
        "Category":  "joke",
        "text":  "When an episode of Walker Texas Ranger was aired in France, the French surrendered to Chuck Norris just to be on the safe side."
    },
    {
        "Category":  "joke",
        "text":  "While urinating, Chuck Norris is easily capable of welding titanium."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris talks, everybody listens. And dies."
    },
    {
        "Category":  "joke",
        "text":  "When Steven Seagal kills a ninja, he only takes its hide. When Chuck Norris kills a ninja, he uses every part."
    },
    {
        "Category":  "joke",
        "text":  "Wilt Chamberlain claims to have slept with more than 20,000 women in his lifetime. Chuck Norris calls this \"a slow Tuesday.\""
    },
    {
        "Category":  "joke",
        "text":  "Contrary to popular belief, there is indeed enough Chuck Norris to go around."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesnt shave; he kicks himself in the face. The only thing that can cut Chuck Norris is Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "For some, the left testicle is larger than the right one. For Chuck Norris, each testicle is larger than the other one."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris always knows the EXACT location of Carmen SanDiego."
    },
    {
        "Category":  "joke",
        "text":  "When taking the SAT, write \"Chuck Norris\" for every answer. You will score over 8000."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris invented black. In fact, he invented the entire spectrum of visible light. Except pink. Tom Cruise invented pink."
    },
    {
        "Category":  "joke",
        "text":  "When you\u0027re Chuck Norris, anything + anything is equal to 1. One roundhouse kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has the greatest Poker-Face of all time. He won the 1983 World Series of Poker, despite holding only a Joker, a Get out of Jail Free Monopoloy card, a 2 of clubs, 7 of spades and a green #4 card from the game UNO."
    },
    {
        "Category":  "joke",
        "text":  "On his birthday, Chuck Norris randomly selects one lucky child to be thrown into the sun."
    },
    {
        "Category":  "joke",
        "text":  "Nobody doesn\u0027t like Sara Lee. Except Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t throw up if he drinks too much. Chuck Norris throws down!"
    },
    {
        "Category":  "joke",
        "text":  "In the beginning there was nothing...then Chuck Norris Roundhouse kicked that nothing in the face and said \"Get a job\". That is the story of the universe."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has 12 moons. One of those moons is the Earth."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris grinds his coffee with his teeth and boils the water with his own rage."
    },
    {
        "Category":  "joke",
        "text":  "Archeologists unearthed an old english dictionary dating back to the year 1236. It defined \"victim\" as \"one who has encountered Chuck Norris\""
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris ordered a Big Mac at Burger King, and got one."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris and Mr. T walked into a bar. The bar was instantly destroyed, as that level of awesome cannot be contained in one building."
    },
    {
        "Category":  "joke",
        "text":  "If you Google search \"Chuck Norris getting his ass kicked\" you will generate zero results. It just doesn\u0027t happen."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can drink an entire gallon of milk in thirty-seven seconds."
    },
    {
        "Category":  "joke",
        "text":  "Little known medical fact: Chuck Norris invented the Caesarean section when he roundhouse-kicked his way out of his monther\u0027s womb."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t bowl strikes, he just knocks down one pin and the other nine faint."
    },
    {
        "Category":  "joke",
        "text":  "The show Survivor had the original premise of putting people on an island with Chuck Norris. There were no survivors, and nobody is brave enough to go to the island to retrieve the footage."
    },
    {
        "Category":  "joke",
        "text":  "It takes Chuck Norris 20 minutes to watch 60 Minutes."
    },
    {
        "Category":  "joke",
        "text":  "You know how they say if you die in your dream then you will die in real life? In actuality, if you dream of death then Chuck Norris will find you and kill you."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has a deep and abiding respect for human life... unless it gets in his way."
    },
    {
        "Category":  "joke",
        "text":  "The Bermuda Triangle used to be the Bermuda Square, until Chuck Norris Roundhouse kicked one of the corners off."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t believe in Germany."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris is in a crowded area, he doesn\u0027t walk around people. He walks through them."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once ate an entire bottle of sleeping pills. They made him blink."
    },
    {
        "Category":  "joke",
        "text":  "James Cameron wanted Chuck Norris to play the Terminator. However, upon reflection, he realized that would have turned his movie into a documentary, so he went with Arnold Schwarzenegger."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can touch MC Hammer."
    },
    {
        "Category":  "joke",
        "text":  "Thousands of years ago Chuck Norris came across a bear. It was so terrified that it fled north into the arctic. It was also so terrified that all of its decendents now have white hair."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris played Russian Roulette with a fully loaded gun and won."
    },
    {
        "Category":  "joke",
        "text":  "It takes 14 puppeteers to make Chuck Norris smile, but only 2 to make him destroy an orphanage."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is responsible for China\u0027s over-population. He hosted a Karate tournament in Beijing and all women within 1,000 miles became pregnant instantly."
    },
    {
        "Category":  "joke",
        "text":  "Some people wear Superman pajamas. Superman wears Chuck Norris pajamas."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once worked as a weatherman for the San Diego evening news. Every night he would make the same forecast: Partly cloudy with a 75% chance of Pain."
    },
    {
        "Category":  "joke",
        "text":  "Simply by pulling on both ends, Chuck Norris can stretch diamonds back into coal."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris does a pushup, he isn\u0027t lifting himself up, he\u0027s pushing the Earth down."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris invented the bolt-action rifle, liquor, sexual intercourse, and football-- in that order."
    },
    {
        "Category":  "joke",
        "text":  "A high tide means Chuck Norris is flying over your coast. The tide is caused by God pissing his pants."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris keeps his friends close and his enemies closer. Close enough to drop them with one round house kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "There is in fact an \u0027I\u0027 in Norris, but there is no \u0027team\u0027. Not even close."
    },
    {
        "Category":  "joke",
        "text":  "Scotty in Star Trek often says \"Ye cannae change the laws of physics.\" This is untrue. Chuck Norris can change the laws of physics. With his fists."
    },
    {
        "Category":  "joke",
        "text":  "An anagram for Walker Texas Ranger is KARATE WRANGLER SEX. I don\u0027t know what that is, but it sounds AWESOME."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t stub his toes. He accidentally destroys chairs, bedframes, and sidewalks."
    },
    {
        "Category":  "joke",
        "text":  "Using his trademark roundhouse kick, Chuck Norris once made a fieldgoal in RJ Stadium in Tampa Bay from the 50 yard line of Qualcomm stadium in San Diego."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris roundhouse kicks don\u0027t really kill people. They wipe out their entire existence from the space-time continuum."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not own a stove, oven, or microwave , because revenge is a dish best served cold."
    },
    {
        "Category":  "joke",
        "text":  "Tom Clancy has to pay royalties to Chuck Norris because \"The Sum of All Fears\" is the name of Chuck Norris\u0027 autobiography."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can slam a revolving door."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris built a better mousetrap, but the world was too frightened to beat a path to his door."
    },
    {
        "Category":  "joke",
        "text":  "The original draft of The Lord of the Rings featured Chuck Norris instead of Frodo Baggins. It was only 5 pages long, as Chuck roundhouse-kicked Sauron\u0027s ass halfway through the first chapter."
    },
    {
        "Category":  "joke",
        "text":  "Hellen Keller\u0027s favorite color is Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris eats beef jerky and craps gunpowder. Then, he uses that gunpowder to make a bullet, which he uses to kill a cow and make more beef jerky. Some people refer to this as the \"Circle of Life.\""
    },
    {
        "Category":  "joke",
        "text":  "If, by some incredible space-time paradox, Chuck Norris would ever fight himself, he\u0027d win. Period."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is currently suing myspace for taking the name of what he calls everything around you."
    },
    {
        "Category":  "joke",
        "text":  "The crossing lights in Chuck Norris\u0027s home town say \"Die slowly\" and \"die quickly\". They each have a picture of Chuck Norris punching or kicking a pedestrian."
    },
    {
        "Category":  "joke",
        "text":  "Science Fact: Roundhouse kicks are comprised primarily of an element called Chucktanium."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris proved that we are alone in the universe. We weren\u0027t before his first space expedition."
    },
    {
        "Category":  "joke",
        "text":  "Superman once watched an episode of Walker, Texas Ranger. He then cried himself to sleep."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t step on toes. Chuck Norris steps on necks."
    },
    {
        "Category":  "joke",
        "text":  "The movie \"Delta Force\" was extremely hard to make because Chuck had to downplay his abilities. The first few cuts were completely unbelievable."
    },
    {
        "Category":  "joke",
        "text":  "Movie trivia: The movie \"Invasion U.S.A.\" is, in fact, a documentary."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not \"style\" his hair. It lays perfectly in place out of sheer terror."
    },
    {
        "Category":  "joke",
        "text":  "There is no such thing as global warming. Chuck Norris was cold, so he turned the sun up."
    },
    {
        "Category":  "joke",
        "text":  "A study showed the leading causes of death in the United States are: 1. Heart disease, 2. Chuck Norris, 3. Cancer"
    },
    {
        "Category":  "joke",
        "text":  "It\u0027s widely believed that Jesus was Chuck Norris\u0027 stunt double for crucifixion due to the fact that it is impossible for nails to pierce Chuck Norris\u0027 skin."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris did in fact, build Rome in a day."
    },
    {
        "Category":  "joke",
        "text":  "Along with his black belt, Chuck Norris often chooses to wear brown shoes. No one has DARED call him on it. Ever."
    },
    {
        "Category":  "joke",
        "text":  "Once you go Norris, you are physically unable to go back."
    },
    {
        "Category":  "joke",
        "text":  "Ninjas want to grow up to be just like Chuck Norris. But usually they grow up just to be killed by Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once sued Burger King after they refused to put razor wire in his Whopper Jr, insisting that that actually is \"his\" way."
    },
    {
        "Category":  "joke",
        "text":  "The last thing you hear before Chuck Norris gives you a roundhouse kick? No one knows because dead men tell no tales."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t play god. Playing is for children."
    },
    {
        "Category":  "joke",
        "text":  "As a teen, Chuck Norris had sex with every nun in a convent tucked away in the hills of Tuscany. Nine months later the nuns gave birth to the 1972 Miami Dolphins, the only undefeated and untied team in professional football history."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the only person in the world that can actually email a roundhouse kick."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris won super bowls VII and VIII singlehandedly before unexpectedly retiring to pursue a career in ass-kicking."
    },
    {
        "Category":  "joke",
        "text":  "Wo hu cang long. The translation from Mandarin Chinese reads: \"Crouching Chuck, Hidden Norris\""
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can set ants on fire with a magnifying glass. At night."
    },
    {
        "Category":  "joke",
        "text":  "Some kids play Kick the can. Chuck Norris played Kick the keg."
    },
    {
        "Category":  "joke",
        "text":  "\u0027Icy-Hot\u0027 is too weak for Chuck Norris. After a workout, Chuck Norris rubs his muscles down with liquid-hot MAGMA."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris cannot love, he can only not kill."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris was a baby, he didn\u0027t suck his mother\u0027s breast. His mother served him whiskey, straight out of the bottle."
    },
    {
        "Category":  "joke",
        "text":  "According to Einstein\u0027s theory of relativity, Chuck Norris can actually roundhouse kick you yesterday."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once pulled out a single hair from his beard and skewered three men through the heart with it."
    },
    {
        "Category":  "joke",
        "text":  "In an act of great philanthropy, Chuck made a generous donation to the American Cancer Society. He donated 6,000 dead bodies for scientific research."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris? favourite cut of meat is the roundhouse."
    },
    {
        "Category":  "joke",
        "text":  "When J. Robert Oppenheimer said \"I am become death, the destroyer Of worlds\", He was not referring to the atomic bomb. He was referring to the Chuck Norris halloween costume he was wearing."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris recently had the idea to sell his urine as a canned beverage. We know this beverage as Red Bull."
    },
    {
        "Category":  "joke",
        "text":  "In a recent survey it was discovered the 94% of American women lost their virginity to Chuck Norris. The other 6% were incredibly fat or ugly."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris invented a language that incorporates karate and roundhouse kicks. So next time Chuck Norris is kicking your ass, don?t be offended or hurt, he may be just trying to tell you he likes your hat."
    },
    {
        "Category":  "joke",
        "text":  "If at first you don\u0027t succeed, you\u0027re not Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "If Chuck Norris were a calendar, every month would be named Chucktober, and every day he\u0027d kick your ass."
    },
    {
        "Category":  "joke",
        "text":  "Fear is not the only emotion Chuck Norris can smell. He can also detect hope, as in \"I hope I don\u0027t get a roundhouse kick from Chuck Norris.\""
    },
    {
        "Category":  "joke",
        "text":  "# Chuck Norris\u0027s show is called Walker: Texas Ranger, because Chuck Norris doesn\u0027t run."
    },
    {
        "Category":  "joke",
        "text":  "MacGyver can build an airplane out of gum and paper clips, but Chuck Norris can roundhouse-kick his head through a wall and take it."
    },
    {
        "Category":  "joke",
        "text":  "Behind every successful man, there is a woman. Behind every dead man, there is Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris brushes his teeth with a mixture of iron shavings, industrial paint remover, and wood-grain alcohol."
    },
    {
        "Category":  "joke",
        "text":  "The easiest way to determine Chuck Norris\u0027 age is to cut him in half and count the rings."
    },
    {
        "Category":  "joke",
        "text":  "There is endless debate about the existence of the human soul. Well it does exist and Chuck Norris finds it delicious."
    },
    {
        "Category":  "joke",
        "text":  "Most boots are made for walkin\u0027. Chuck Norris\u0027 boots ain\u0027t that merciful."
    },
    {
        "Category":  "joke",
        "text":  "The US did not boycott the 1980 Summer Olympics in Moscow due to political reasons: Chuck Norris killed the entire US team with a single round-house kick during TaeKwonDo practice."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris wears a live rattlesnake as a condom."
    },
    {
        "Category":  "joke",
        "text":  "The Bible was originally titled \"Chuck Norris and Friends\""
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris began selling the Total Gym as an ill-fated attempt to make his day-to-day opponents less laughably pathetic."
    },
    {
        "Category":  "joke",
        "text":  "Do you know why Baskin Robbins only has 31 flavors? Because Chuck Norris doesn\u0027t like Fudge Ripple."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris says \"More cowbell\", he MEANS it."
    },
    {
        "Category":  "joke",
        "text":  "On the set of Walker Texas Ranger Chuck Norris brought a dying lamb back to life by nuzzling it with his beard. As the onlookers gathered, the lamb sprang to life. Chuck Norris then roundhouse kicked it, killing it instantly. This was just to prove that the good Chuck givet"
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris was what Willis was talkin\u0027 about."
    },
    {
        "Category":  "joke",
        "text":  "Google won\u0027t search for Chuck Norris because it knows you don\u0027t find Chuck Norris, he finds you."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can lead a horse to water AND make it drink."
    },
    {
        "Category":  "joke",
        "text":  "Nagasaki never had a bomb dropped on it. Chuck Norris jumped out of a plane and punched the ground"
    },
    {
        "Category":  "joke",
        "text":  "It is scientifically impossible for Chuck Norris to have had a mortal father. The most popular theory is that he went back in time and fathered himself."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris destroyed the periodic table, because Chuck Norris only recognizes the element of surprise."
    },
    {
        "Category":  "joke",
        "text":  "It is believed dinosaurs are extinct due to a giant meteor. That\u0027s true if you want to call Chuck Norris a giant meteor."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris shot the sheriff, but he round house kicked the deputy."
    },
    {
        "Category":  "joke",
        "text":  "That\u0027s not Chuck Norris doing push-ups -- that\u0027s Chuck Norris moving the Earth away from the path of a deadly asteroid."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can judge a book by its cover."
    },
    {
        "Category":  "joke",
        "text":  "Nothing can escape the gravity of a black hole, except for Chuck Norris. Chuck Norris eats black holes. They taste like chicken."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not play the lottery. It doesn\u0027t have nearly enough balls."
    },
    {
        "Category":  "joke",
        "text":  "How many Chuck Norris\u0027 does it take to change a light bulb? None, Chuck Norris prefers to kill in the dark."
    },
    {
        "Category":  "joke",
        "text":  "As President Roosevelt said: \"We have nothing to fear but fear itself. And Chuck Norris.\""
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris just says \"no\" to drugs. If he said \"yes\", it would collapse Colombia\u0027s infrastructure."
    },
    {
        "Category":  "joke",
        "text":  "Crime does not pay - unless you are an undertaker following Walker, Texas Ranger, on a routine patrol."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris invented the internet? just so he had a place to store his porn."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not own a house. He walks into random houses and people move."
    },
    {
        "Category":  "joke",
        "text":  "It is better to give than to receive. This is especially true of a Chuck Norris roundhouse kick."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the only person to ever win a staring contest against Ray Charles and Stevie Wonder."
    },
    {
        "Category":  "joke",
        "text":  "Industrial logging isn\u0027t the cause of deforestation. Chuck Norris needs toothpicks."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris smells what the Rock is cooking... because the Rock is Chuck Norris\u0027 personal chef."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris plays Oregon Trail, his family does not die from cholera or dysentery, but rather, roundhouse kicks to the face. He also requires no wagon, since he carries the oxen, axels, and buffalo meat on his back. He always makes it to Oregon before you."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the reason why Waldo is hiding."
    },
    {
        "Category":  "joke",
        "text":  "\"Brokeback Mountain\" is not just a movie. It\u0027s also what Chuck Norris calls the pile of dead ninjas in his front yard."
    },
    {
        "Category":  "joke",
        "text":  "When God said, \"let there be light\", Chuck Norris said, \"say \u0027please\u0027.\""
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not eat. Food understands that the only safe haven from Chuck Norris\u0027 fists is inside his own body."
    },
    {
        "Category":  "joke",
        "text":  "One day Chuck Norris walked down the street with a massive erection. There were no survivors."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris built a time machine and went back in time to stop the JFK assassination. As Oswald shot, Chuck met all three bullets with his beard, deflecting them. JFK\u0027s head exploded out of sheer amazement."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris uses a night light. Not because Chuck Norris is afraid of the dark, but the dark is afraid of Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "When Bruce Banner gets mad, he turns into the Hulk. When the Hulk gets mad, he turns into Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris kills anyone that asks: \"Do you want fries with that?\". Because by now everyone should know that Chuck doesn\u0027t want fries with anything. Ever."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once kicked a horse in the chin. Its decendants are known today as Giraffes."
    },
    {
        "Category":  "joke",
        "text":  "Sticks and stones may break your bones, but a Chuck Norris glare will liquefy your kidneys."
    },
    {
        "Category":  "joke",
        "text":  "Human cloning is outlawed because of Chuck Norris, because then it would be possible for a Chuck Norris roundhouse kick to meet another Chuck Norris roundhouse kick. Physicists theorize that this contact would end the universe."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once went skydiving, but promised never to do it again. One Grand Canyon is enough."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s version of a \"chocolate milkshake\" is a raw porterhouse wrapped around ten Hershey bars, and doused in diesel fuel."
    },
    {
        "Category":  "joke",
        "text":  "In a fight between Batman and Darth Vader, the winner would be Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris puts his pants on one leg at a time, just like the rest of us. The only difference is, then he kills people."
    },
    {
        "Category":  "joke",
        "text":  "Everybody loves Raymond. Except Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Contrary to popular belief, the Titanic didn\u0027t hit an iceberg. The ship was off course and ran into Chuck Norris while he was doing the backstroke across the Atlantic."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris got his drivers license at the age of 16. Seconds."
    },
    {
        "Category":  "joke",
        "text":  "The original title for Alien vs. Predator was Alien and Predator vs Chuck Norris. The film was cancelled shortly after going into preproduction. No one would pay nine dollars to see a movie fourteen seconds long."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris? sperm is so badass, he had sex with Nicole Kidman, and 7 months later she prematurely gave birth to a Ford Excursion."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can win at solitaire with only 18 cards."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once shat blood - the blood of 11,940 natives he had killed and eaten."
    },
    {
        "Category":  "joke",
        "text":  "Maslow\u0027s theory of higher needs does not apply to Chuck Norris. He only has two needs: killing people and finding people to kill."
    },
    {
        "Category":  "joke",
        "text":  "The truth will set you free. Unless Chuck Norris has you, in which case, forget it buddy!"
    },
    {
        "Category":  "joke",
        "text":  "Kryptonite has been found to contain trace elements of Chuck Norris roundhouse kicks to the face. This is why it is so deadly to Superman."
    },
    {
        "Category":  "joke",
        "text":  "Saddam Hussein was not found hiding in a \"hole.\" Saddam was roundhouse-kicked in the head by Chuck Norris in Kansas, which sent him through the earth, stopping just short of the surface of Iraq."
    },
    {
        "Category":  "joke",
        "text":  "Coroners refer to dead people as \"ABC\u0027s\". Already Been Chucked."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t look both ways before he crosses the street... he just roundhouses any cars that get too close."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not have to answer the phone. His beard picks up the incoming electrical impulses and translates them into audible sound."
    },
    {
        "Category":  "joke",
        "text":  "How many roundhouse kicks does it take to get to the center of a tootsie pop? Just one. From Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesnt wear a watch, HE decides what time it is."
    },
    {
        "Category":  "joke",
        "text":  "The phrase \u0027break a leg\u0027 was originally coined by Chuck Norris\u0027s co-stars in Walker, Texas Ranger as a good luck charm, indicating that a broken leg might be the worst extent of their injuries. This never proved to be the case."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris does division, there are no remainders."
    },
    {
        "Category":  "joke",
        "text":  "If you rearrange the letters in \"Chuck Norris\", they also spell \"Crush Rock In\". The words \"with his fists\" are understood."
    },
    {
        "Category":  "joke",
        "text":  "Never look a gift Chuck Norris in the mouth, because he will bite your damn eyes off."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris used to play baseball. When Babe Ruth was hailed as the better player, Chuck Norris killed him with a baseball bat to the throat. Lou Gehrig got off easy."
    },
    {
        "Category":  "joke",
        "text":  "The original title for Star Wars was \"Skywalker: Texas Ranger\". Starring Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Guantuanamo Bay, Cuba, is the military code-word for \"Chuck Norris\u0027 basement\"."
    },
    {
        "Category":  "joke",
        "text":  "The phrase \u0027balls to the wall\u0027 was originally conceived to describe Chuck Norris entering any building smaller than an aircraft hangar."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris? roundhouse kick is so powerful, it can be seen from outer space by the naked eye."
    },
    {
        "Category":  "joke",
        "text":  "Ozzy Osbourne bites the heads off of bats. Chuck Norris bites the heads off of Siberian Tigers."
    },
    {
        "Category":  "joke",
        "text":  "He who lives by the sword, dies by the sword. He who lives by Chuck Norris, dies by the roundhouse kick."
    },
    {
        "Category":  "joke",
        "text":  "The best-laid plans of mice and men often go awry. Even the worst-laid plans of Chuck Norris come off without a hitch."
    },
    {
        "Category":  "joke",
        "text":  "The phrase \u0027dead ringer\u0027 refers to someone who sits behind Chuck Norris in a movie theater and forgets to turn their cell phone off."
    },
    {
        "Category":  "joke",
        "text":  "Staring at Chuck Norris for extended periods of time without proper eye protection will cause blindess, and possibly foot sized brusies on the face."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can taste lies."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not kick ass and take names. In fact, Chuck Norris kicks ass and assigns the corpse a number. It is currently recorded to be in the billions."
    },
    {
        "Category":  "joke",
        "text":  "One time, Chuck Norris accidentally stubbed his toe. It destroyed the entire state of Ohio."
    },
    {
        "Category":  "joke",
        "text":  "Little Miss Muffet sat on her tuffet, until Chuck Norris roundhouse kicked her into a glacier."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can blow bubbles with beef jerky."
    },
    {
        "Category":  "joke",
        "text":  "They had to edit the first ending of \u0027Lone Wolf McQuade\u0027 after Chuck Norris kicked David Carradine\u0027s ass, then proceeded to barbecue and eat him."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does, in fact, live in a round house."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris works out on the Total Gym, the Total Gym feels like it\u0027s been raped."
    },
    {
        "Category":  "joke",
        "text":  "4 out of 5 doctors fail to recommend Chuck Norris as a solution to most problems. Also, 80% of doctors die unexplained, needlessly brutal deaths."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can skeletize a cow in two minutes."
    },
    {
        "Category":  "joke",
        "text":  "The only sure things are Death and Taxes?and when Chuck Norris goes to work for the IRS, they\u0027ll be the same thing."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 first job was as a paperboy. There were no survivors."
    },
    {
        "Category":  "joke",
        "text":  "With the rising cost of gasoline, Chuck Norris is beginning to worry about his drinking habit."
    },
    {
        "Category":  "joke",
        "text":  "The square root of Chuck Norris is pain. Do not try to square Chuck Norris, the result is death."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 testicles do not produce sperm. They produce tiny white ninjas that recognize only one mission: seek and destroy."
    },
    {
        "Category":  "joke",
        "text":  "To be or not to be? That is the question. The answer? Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has never been in a fight, ever. Do you call one roundhouse kick to the face a fight?"
    },
    {
        "Category":  "joke",
        "text":  "There are two types of people in the world... people that suck, and Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris never wet his bed as a child. The bed wet itself out of fear."
    },
    {
        "Category":  "joke",
        "text":  "If you were somehow able to land a punch on Chuck Norris your entire arm would shatter upon impact. This is only in theory, since, come on, who in their right mind would try this?"
    },
    {
        "Category":  "joke",
        "text":  "70% of a human\u0027s weight is water. 70% of Chuck Norris\u0027 weight is his dick."
    },
    {
        "Category":  "joke",
        "text":  "Jean-Claude Van Damme once kicked Chuck Norris\u0027 ass. He was then awakened from his dream by a roundhouse kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "The pie scene in \"American Pie\" is based on a dare Chuck Norris took when he was younger. However, in Chuck Norris\u0027 case, the \"pie\" was the molten crater of an active volcano."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris uses 8\u0027x10\u0027 sheets of plywood as toilet paper."
    },
    {
        "Category":  "joke",
        "text":  "Noah was the only man notified before Chuck Norris relieved himself in the Atlantic Ocean."
    },
    {
        "Category":  "joke",
        "text":  "MacGyver immediately tried to make a bomb out of some Q-Tips and Gatorade, but Chuck Norris roundhouse-kicked him in the solar plexus. MacGyver promptly threw up his own heart."
    },
    {
        "Category":  "joke",
        "text":  "Jack Bauer tried to use his detailed knowledge of torture techniques, but to no avail: Chuck Norris thrives on pain. Chuck Norris then ripped off Jack Bauer\u0027s arm and beat him to death with it. Game, set, match."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris eats steak for every single meal. Most times he forgets to kill the cow."
    },
    {
        "Category":  "joke",
        "text":  "The First Law of Thermodynamics states that energy can neither be created nor destroyed... unless it meets Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t go on the internet, he has every internet site stored in his memory. He refreshes webpages by blinking."
    },
    {
        "Category":  "joke",
        "text":  "Fact: Chuck Norris doesn\u0027t consider it sex if the woman survives."
    },
    {
        "Category":  "joke",
        "text":  "It is said that looking into Chuck Norris\u0027 eyes will reveal your future. Unfortunately, everybody\u0027s future is always the same: death by a roundhouse-kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris knows everything there is to know - Except for the definition of mercy."
    },
    {
        "Category":  "joke",
        "text":  "Scientifically speaking, it is impossible to charge Chuck Norris with \"obstruction of justice.\" This is because even Chuck Norris cannot be in two places at the same time."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris never has to wax his skis because they\u0027re always slick with blood."
    },
    {
        "Category":  "joke",
        "text":  "When you say \"no one\u0027s perfect\", Chuck Norris takes this as a personal insult."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can win a game of Trivial Pursuit with one roll of the dice, and without answering a single question... just a nod of the head, and a stroke of the beard."
    },
    {
        "Category":  "joke",
        "text":  "182,000 Americans die from Chuck Norris-related accidents every year."
    },
    {
        "Category":  "joke",
        "text":  "Paper beats rock, rock beats scissors, and scissors beats paper, but Chuck Norris beats all 3 at the same time."
    },
    {
        "Category":  "joke",
        "text":  "Jesus can walk on water, but Chuck Norris can walk on Jesus."
    },
    {
        "Category":  "joke",
        "text":  "All roads lead to Chuck Norris. And by the transitive property, a roundhouse kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "July 4th is Independence day. And the day Chuck Norris was born. Coincidence? I think not."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris never goes to the dentist because his teeth are unbreakable. His enemies never go to the dentist because they have no teeth."
    },
    {
        "Category":  "joke",
        "text":  "In the medical community, death is referred to as \"Chuck Norris Disease\""
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris was once in a knife fight, and the knife lost."
    },
    {
        "Category":  "joke",
        "text":  "If you work in an office with Chuck Norris, don\u0027t ask him for his three-hole-punch."
    },
    {
        "Category":  "joke",
        "text":  "In the Words of Julius Caesar, \"Veni, Vidi, Vici, Chuck Norris\". Translation: I came, I saw, and I was roundhouse-kicked inthe face by Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "The First rule of Chuck Norris is: you do not talk about Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is widely predicted to be first black president. If you\u0027re thinking to yourself, \"But Chuck Norris isn\u0027t black\", then you are dead wrong. And stop being a racist."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris plays Monopoly, it affects the actual world economy."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can be unlocked on the hardest level of Tekken. But only Chuck Norris is skilled enough to unlock himself. Then he roundhouse kicks the Playstation back to Japan."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris drinks napalm to quell his heartburn."
    },
    {
        "Category":  "joke",
        "text":  "Every time someone uses the word \"intense\", Chuck Norris always replies \"you know what else is intense?\" followed by a roundhouse kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "As an infant, Chuck Norris\u0027 parents gave him a toy hammer. He gave the world Stonehenge."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once ordered a steak in a restaurant. The steak did what it was told."
    },
    {
        "Category":  "joke",
        "text":  "Most people fear the Reaper. Chuck Norris considers him \"a promising Rookie\"."
    },
    {
        "Category":  "joke",
        "text":  "There are only two things that can cut diamonds: other diamonds, and Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "President Roosevelt once rode his horse 100 miles. Chuck Norris carried his the same distance in half the time."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once ate four 30lb bowling balls without chewing."
    },
    {
        "Category":  "joke",
        "text":  "What many people dont know is Chuck Norris is the founder of planned parenthood. Not even unborn children can escape his wrath."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris was banned from competitive bullriding after a 1992 exhibition in San Antonio, when he rode the bull 1,346 miles from Texas to Milwaukee Wisconsin to pick up his dry cleaning."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris qualified with a top speed of 324 mph at the Daytona 500, without a car."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris likes his coffee half and half: half coffee grounds, half wood-grain alcohol."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris uses tabasco sauce instead of visine."
    },
    {
        "Category":  "joke",
        "text":  "The chemical formula for the highly toxic cyanide ion is CN-. These are also Chuck Norris\u0027 initials. This is not a coincidence."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 credit cards have no limit. Last weekend, he maxed them out."
    },
    {
        "Category":  "joke",
        "text":  "Think of a hot woman. Chuck Norris did her."
    },
    {
        "Category":  "joke",
        "text":  "A man once claimed Chuck Norris kicked his ass twice, but it was promptly dismissed as false - no one could survive it the first time."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris sleeps with a pillow under his gun."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris owns a chain of fast-food restaurants throughout the southwest. They serve nothing but barbecue-flavored ice cream and Hot Pockets."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t chew gum. Chuck Norris chews tin foil."
    },
    {
        "Category":  "joke",
        "text":  "Aliens DO indeed exist. They just know better than to visit a planet that Chuck Norris is on."
    },
    {
        "Category":  "joke",
        "text":  "When in a bar, you can order a drink called a \"Chuck Norris\". It is also known as a \"Bloody Mary\", if your name happens to be Mary."
    },
    {
        "Category":  "joke",
        "text":  "Every time Chuck Norris smiles, someone dies. Unless he smiles while he?s roundhouse kicking someone in the face. Then two people die."
    },
    {
        "Category":  "joke",
        "text":  "Some people ask for a Kleenex when they sneeze, Chuck Norris asks for a body bag."
    },
    {
        "Category":  "joke",
        "text":  "There?s an order to the universe: space, time, Chuck Norris.... Just kidding, Chuck Norris is first."
    },
    {
        "Category":  "joke",
        "text":  "A man once asked Chuck Norris if his real name is \"Charles\". Chuck Norris did not respond, he simply stared at him until he exploded."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris starts everyday with a protein shake made from Carnation Instant Breakfast, one dozen eggs, pure Colombian cocaine, and rattlesnake venom. He injects it directly into his neck with a syringe."
    },
    {
        "Category":  "joke",
        "text":  "In a tagteam match, Chuck Norris was teamed with Hulk Hogan against King Kong Bundy and Andre The Giant. He pinned all 3 at the same time."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t see dead people. He makes people dead."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the only person who can simultaneously hold and fire FIVE Uzis: One in each hand, one in each foot -- and the 5th one he roundhouse-kicks into the air, so that it sprays bullets."
    },
    {
        "Category":  "joke",
        "text":  "For undercover police work, Chuck Norris pins his badge underneath his shirt, directly into his chest."
    },
    {
        "Category":  "joke",
        "text":  "In the X-Men movies, none of the X-Men super-powers are done with special effects. Chuck Norris is the stuntman for every character."
    },
    {
        "Category":  "joke",
        "text":  "We live in an expanding universe. All of it is trying to get away from Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "The word \u0027Kill\u0027 was invented by Chuck Norris. Other words were \u0027Die\u0027, \u0027Beer\u0027, and \u0027What\u0027."
    },
    {
        "Category":  "joke",
        "text":  "The 11th commandment is ?Thou shalt not piss off Chuck Norris? This commandment is rarely enforced, as it is impossible to accomplish."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is his own line at the DMV."
    },
    {
        "Category":  "joke",
        "text":  "Two wrongs don\u0027t make a right. Unless you\u0027re Chuck Norris. Then two wrongs make a roundhouse kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "Who let the dogs out? Chuck Norris let the dogs out... and then roundhouse kicked them through an Oldsmobile."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can do a roundhouse kick faster than the speed of light. This means that if you turn on a light switch, you will be dead before the lightbulb turns on."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris goes to out to eat, he orders a whole chicken, but he only eats its soul."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has never won an Academy Award for acting... because he\u0027s not acting."
    },
    {
        "Category":  "joke",
        "text":  "If Chuck Norris wants your opinion, he\u0027ll beat it into you."
    },
    {
        "Category":  "joke",
        "text":  "Not everyone that Chuck Norris is mad at gets killed. Some get away. They are called astronauts."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has to register every part of his body as a separate lethal weapon. His spleen is considered a concealed weapon in over 50 states."
    },
    {
        "Category":  "joke",
        "text":  "A movie scene depicting Chuck Norris losing a fight with Bruce Lee was the product of history\u0027s most expensive visual effect. When adjusted for inflation, the effect cost more than the Gross National Product of Paraguay."
    },
    {
        "Category":  "joke",
        "text":  "Godzilla is a Japanese rendition of Chuck Norris\u0027 first visit to Tokyo."
    },
    {
        "Category":  "joke",
        "text":  "They once made a Chuck Norris toilet paper, but there was a problem-- It wouldn\u0027t take shit from anybody."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once rode a nine foot grizzly bear through an automatic car wash, instead of taking a shower."
    },
    {
        "Category":  "joke",
        "text":  "\"Sweating bullets\" is literally what happens when Chuck Norris gets too hot."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 sperm can be seen with the naked eye. Each one is the size of a quarter."
    },
    {
        "Category":  "joke",
        "text":  "After taking a steroids test doctors informed Chuck Norris that he had tested positive. He laughed upon receiving this information, and said \"of course my urine tested positive, what do you think they make steroids from?\""
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t daydream. He\u0027s too busy giving other people nightmares."
    },
    {
        "Category":  "joke",
        "text":  "When Arnold says \"I\u0027ll be back\" in Terminator movie it is implied that he\u0027s going to ask Chuck Norris for help."
    },
    {
        "Category":  "joke",
        "text":  "There are no such things as tornados. Chuck Norris just hates trailer parks."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 Penis is a third degree blackbelt, and an honorable 32nd-degree mason."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not follow fashion trends, they follow him. But then he turns around and kicks their ass. Nobody follows Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Diamonds are not, despite popular belief, carbon. They are, in fact, Chuck Norris fecal matter. This was proven a recently, when scientific analysis revealed what appeared to be Jean-Claude Van Damme bone fragments inside the Hope Diamond."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once participated in the running of the bulls. He walked."
    },
    {
        "Category":  "joke",
        "text":  "The Drummer for Def Leppard\u0027s only got one arm. Chuck Norris needed a back scratcher."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris was the orginal sculptor of Mount Rushmore. He completed the entire project using only a bottle opener and a drywall trowel."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once rode a bull, and nine months later it had a calf."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once lost the remote, but maintained control of the TV by yelling at it in between bites of his \"Filet of Child\" sandwich."
    },
    {
        "Category":  "joke",
        "text":  "For Spring Break \u002705, Chuck Norris drove to Madagascar, riding a chariot pulled by two electric eels."
    },
    {
        "Category":  "joke",
        "text":  "The Manhattan Project was not intended to create nuclear weapons, it was meant to recreate the destructive power in a Chuck Norris Roundhouse Kick. They didn\u0027t even come close."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has banned rainbows from the state of North Dakota."
    },
    {
        "Category":  "joke",
        "text":  "Divide Chuck Norris by zero and you will in fact get one........one bad-ass that is."
    },
    {
        "Category":  "joke",
        "text":  "TNT was originally developed by Chuck Norris to cure indigestion."
    },
    {
        "Category":  "joke",
        "text":  "After returning from World War 2 unscrathed, Bob Dole was congratulated by Chuck Norris with a handshake. The rest is history."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris runs on batteries. Specifically, Die Hards."
    },
    {
        "Category":  "joke",
        "text":  "\"Let the Bodies Hit the Floor\" was originally written as Chuck Norris\u0027 theme song."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris will never have a heart attack. His heart isn\u0027t nearly foolish enough to attack him."
    },
    {
        "Category":  "joke",
        "text":  "Only Chuck Norris can prevent forest fires."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris makes a burrito, its main ingredient is real toes."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is not Irish. His hair is soaked in the blood of his victims."
    },
    {
        "Category":  "joke",
        "text":  "In the movie \"The Matrix\", Chuck Norris is the Matrix. If you pay close attention in the green \"falling code\" scenes, you can make out the faint texture of his beard."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 dick is so big, it has it\u0027s own dick, and that dick is still bigger than yours."
    },
    {
        "Category":  "joke",
        "text":  "They say curiosity killed the cat. This is false. Chuck Norris killed the cat. Every single one of them."
    },
    {
        "Category":  "joke",
        "text":  "There is no such thing as a lesbian, just a woman who has never met Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris crossed the road. No one has ever dared question his motives."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris was born, he immediately had sex with the first nurse he saw. He was her first. She was his third. That afternoon."
    },
    {
        "Category":  "joke",
        "text":  "One time, at band camp, Chuck Norris ate a percussionist."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t say \"who\u0027s your daddy\", because he knows the answer."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris originally wrote the first dictionary. The definition for each word is as follows - A swift roundhouse kick to the face."
    },
    {
        "Category":  "joke",
        "text":  "Love does not hurt. Chuck Norris does."
    },
    {
        "Category":  "joke",
        "text":  "The term \"Cleveland Steamer\" got its name from Chuck Norris, when he took a dump while visiting the Rock and Roll Hall of fame and buried northern Ohio under a glacier of fecal matter."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once round-house kicked a salesman. Over the phone."
    },
    {
        "Category":  "joke",
        "text":  "The pen is mighter than the sword, but only if the pen is held by Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris knows the last digit of pi."
    },
    {
        "Category":  "joke",
        "text":  "Those aren\u0027t credits that roll after Walker Texas Ranger. It is actually a list of fatalities that occurred during the making of the episode."
    },
    {
        "Category":  "joke",
        "text":  "The air around Chuck Norris is always a balmy 78 degrees."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris wants an egg, he cracks open a chicken."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris plays racquetball with a waffle iron and a bowling ball."
    },
    {
        "Category":  "joke",
        "text":  "According to the Bible, God created the universe in six days. Before that, Chuck Norris created God by snapping his fingers."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t believe in ravioli. He stuffs a live turtle with beef and smothers it in pig\u0027s blood."
    },
    {
        "Category":  "joke",
        "text":  "Count from one to ten. That\u0027s how long it would take Chuck Norris to kill you...Fourty seven times."
    },
    {
        "Category":  "joke",
        "text":  "The 1972 Miami Dolphins lost one game, it was a game vs. Chuck Norris and three seven year old girls. Chuck Norris won with a roundhouse-kick to the face in overtime."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is not Politically Correct. He is just Correct. Always."
    },
    {
        "Category":  "joke",
        "text":  "Mr. T pities the fool. Chuck Norris rips the fool\u0027s head off."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris had to stop washing his clothes in the ocean. The tsunamis were killing people."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has volunteered to remain on earth after the Rapture; he will spend his time fighting the Anti-Christ."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the only known mammal in history to have an opposable thumb. On his penis."
    },
    {
        "Category":  "joke",
        "text":  "A man once taunted Chuck Norris with a bag of Lay\u0027s potato chips, saying \"Betcha can\u0027t eat just one!\" Chuck Norris proceeded to eat the chips, the bag, and the man in one deft move."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 favorite cereal is Kellogg\u0027s Nails \u0027N\u0027 Gravel."
    },
    {
        "Category":  "joke",
        "text":  "In the first Jurassic Park movie, the Tyrannosaurus Rex wasn\u0027t chasing the jeep. Chuck Norris was chasing the Tyrannosaurus AND the jeep."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris has never been accused of murder because his roundhouse kicks are recognized as \"acts of God.\""
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not wear a condom. Because there is no such thing as protection from Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Rules of fighting: 1) Don\u0027t bring a knife to a gun fight. 2) Don\u0027t bring a gun to a Chuck Norris fight."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the only man who has, literally, beaten the odds. With his fists."
    },
    {
        "Category":  "joke",
        "text":  "In ancient China there is a legend that one day a child will be born from a dragon, grow to be a man, and vanquish evil from the land. That man is not Chuck Norris, because Chuck Norris killed that man."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris wipes his ass with chain mail and sandpaper."
    },
    {
        "Category":  "joke",
        "text":  "When you play Monopoly with Chuck Norris, you do not pass go, and you do not collect two hundred dollars. You will be lucky if you make it out alive."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris describes human beings as \"a sociable holder for blood and guts\"."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris likes his ice like he likes his skulls: crushed."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can kick through all 6 degrees of separation, hitting anyone, anywhere, in the face, at any time."
    },
    {
        "Category":  "joke",
        "text":  "Most tough men eat nails for breakfast. Chuck Norris does all of his grocery shopping at Home Depot."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris did not \"lose\" his virginity, he stalked it and then destroyed it with extreme prejudice."
    },
    {
        "Category":  "joke",
        "text":  "Everything King Midas touches turnes to gold. Everything Chuck Norris touches turns up dead."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris throws exceptions, it\u0027s across the room."
    },
    {
        "Category":  "joke",
        "text":  "All arrays Chuck Norris declares are of infinite size, because Chuck Norris knows no bounds."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t have disk latency because the hard drive knows to hurry the hell up."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris writes code that optimizes itself."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can\u0027t test for equality because he has no equal."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t need garbage collection because he doesn\u0027t call .Dispose(), he calls .DropKick()."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s first program was kill -9."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris burst the dot com bubble."
    },
    {
        "Category":  "joke",
        "text":  "All browsers support the hex definitions #chuck and #norris for the colors black and blue."
    },
    {
        "Category":  "joke",
        "text":  "MySpace actually isn\u0027t your space, it\u0027s Chuck\u0027s (he just lets you use it)."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can write infinite recursion functions and have them return."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can solve the Towers of Hanoi in one move."
    },
    {
        "Category":  "joke",
        "text":  "The only pattern Chuck Norris knows is God Object."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris finished World of Warcraft."
    },
    {
        "Category":  "joke",
        "text":  "Project managers never ask Chuck Norris for estimations... ever."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t use web standards as the web will conform to him."
    },
    {
        "Category":  "joke",
        "text":  "\"It works on my machine\" always holds true for Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Whiteboards are white because Chuck Norris scared them that way."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t do Burn Down charts, he does Smack Down charts."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can delete the Recycling Bin."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s beard can type 140 wpm."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can unit test entire applications with a single assert."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t bug hunt as that signifies a probability of failure, he goes bug killing."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s keyboard doesn\u0027t have a Ctrl key because nothing controls Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris is web surfing websites get the message \"Warning: Internet Explorer has deemed this user to be malicious or dangerous. Proceed?\"."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can overflow your stack just by looking at it."
    },
    {
        "Category":  "joke",
        "text":  "To Chuck Norris, everything contains a vulnerability."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t need sudo, he just types \"Chuck Norris\" before his commands."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t need a debugger, he just stares down the bug until the code confesses."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can access private methods."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can instantiate an abstract class."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not need to know about class factory pattern. He can instantiate interfaces."
    },
    {
        "Category":  "joke",
        "text":  "The class object inherits from Chuck Norris"
    },
    {
        "Category":  "joke",
        "text":  "For Chuck Norris, NP-Hard = O(1)."
    },
    {
        "Category":  "joke",
        "text":  "Bill Gates thinks he\u0027s Chuck Norris. Chuck Norris actually laughed. Once."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is actually the front man for Apple. He let\u0027s Steve Jobs run the show when he\u0027s on a mission. Chuck Norris is always on a mission."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 Internet connection is faster upstream than downstream because even data has more incentive to run from him than to him."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris solved the Travelling Salesman problem in O(1) time. Here\u0027s the pseudo-code: Break salesman into N pieces. Kick each piece to a different city."
    },
    {
        "Category":  "joke",
        "text":  "No statement can catch the ChuckNorrisException."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t pair program."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can write multi-threaded applications with a single thread."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t need to use AJAX because pages are too afraid to postback anyways."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t use reflection, reflection asks politely for his help."
    },
    {
        "Category":  "joke",
        "text":  "There is no Esc key on Chuck Norris\u0027 keyboard, because no one escapes Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can binary search unsorted data."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris breaks RSA 128-bit encrypted codes in milliseconds."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t needs try-catch, exceptions are too afraid to raise."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris went out of an infinite loop."
    },
    {
        "Category":  "joke",
        "text":  "If Chuck Norris writes code with bugs, the bugs fix themselves."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris hosting is 101% uptime guaranteed."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s keyboard has the Any key."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can access the DB from the UI."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 programs never exit, they terminate."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris insists on strongly-typed programming languages."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris protocol design method has no status, requests or responses, only commands."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris programs occupy 150% of CPU, even when they are not executing."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can spawn threads that complete before they are started."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris programs do not accept input."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can install iTunes without installing Quicktime."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t need an OS."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s OSI network model has only one layer - Physical."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can compile syntax errors."
    },
    {
        "Category":  "joke",
        "text":  "Every SQL statement that Chuck Norris codes has an implicit \"COMMIT\" in its end."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not need to type-cast. The Chuck-Norris Compiler (CNC) sees through things. All way down. Always."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does not code in cycles, he codes in strikes."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t use a computer because a computer does everything slower than Chuck Norris."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris compresses his files by doing a flying round house kick to the hard drive."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris solved the halting problem."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t cheat death. He wins fair and square."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris once won a game of connect four in 3 moves."
    },
    {
        "Category":  "joke",
        "text":  "With Chuck Norris P = NP. There\u0027s no nondeterminism with Chuck Norris decisions."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can do a wheelie on a unicycle."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can win in a game of Russian roulette with a fully loaded gun."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris eats lightning and shits out thunder."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can retrieve anything from /dev/null."
    },
    {
        "Category":  "joke",
        "text":  "No one has ever pair-programmed with Chuck Norris and lived to tell about it."
    },
    {
        "Category":  "joke",
        "text":  "No one has ever spoken during review of Chuck Norris\u0027 code and lived to tell about it."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t use GUI, he prefers COMMAND line."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t use Oracle, he is the Oracle."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can dereference NULL."
    },
    {
        "Category":  "joke",
        "text":  "Jesus can walk on water, but Chuck Norris can swim through land."
    },
    {
        "Category":  "joke",
        "text":  "A diff between your code and Chuck Norris\u0027s is infinite."
    },
    {
        "Category":  "joke",
        "text":  "The Chuck Norris Eclipse plugin made alien contact."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris is the ultimate mutex, all threads fear him."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris uses canvas in IE."
    },
    {
        "Category":  "joke",
        "text":  "Don\u0027t worry about tests, Chuck Norris\u0027s test cases cover your code too."
    },
    {
        "Category":  "joke",
        "text":  "Each hair in Chuck Norris\u0027s beard contributes to make the world\u0027s largest DDOS."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s log statements are always at the FATAL level."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s database has only one table, \u0027Kick\u0027, which he DROPs frequently."
    },
    {
        "Category":  "joke",
        "text":  "When Chuck Norris break the build, you can\u0027t fix it, because there is not a single line of code left."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris types with one finger. He points it at the keyboard and the keyboard does the rest."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s programs can pass the Turing Test by staring at the interrogator."
    },
    {
        "Category":  "joke",
        "text":  "If you try to kill -9 Chuck Norris\u0027s programs, it backfires."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027s brain waves are suspected to be harmful to cell phones."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris does infinit loops in 4 seconds."
    },
    {
        "Category":  "joke",
        "text":  "Product Owners never ask Chuck Norris for more features. They ask for mercy."
    },
    {
        "Category":  "joke",
        "text":  "Product Owners never argue with Chuck Norris after he demonstrates the DropKick feature."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris killed two stones with one bird."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can speak Braille."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can over-write a locked variable."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris knows the value of NULL, and he can sort by it too."
    },
    {
        "Category":  "joke",
        "text":  "China lets Chuck Norris search for porn on Google."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can install a 64 bit OS on 32 bit machines."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t have pubic hairs because hair doesn\u0027t grow on balls of steal."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can write to an output stream."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can read from an input stream."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris never has to build his program to machine code. Machines have learnt to interpret Chuck Norris code."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris\u0027 unit tests don\u0027t run. They die."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris sits at the stand-up."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris doesn\u0027t need an account. He just logs in."
    },
    {
        "Category":  "joke",
        "text":  "How many Chuck Norris require to screw a light bulb? None, he will screw it all."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris causes the Windows Blue Screen of Death."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can download emails with his pick-up."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris can make a class that is both abstract and final."
    },
    {
        "Category":  "joke",
        "text":  "Chuck Norris could use anything in java.util.* to kill you, including the javadocs."
    },
    {
        "Category":  "joke",
        "text":  "Code runs faster when Chuck Norris watches it."
    },
    {
        "Category":  "joke",
        "text":  "Only Chuck Norris shuts down websites without due process, not SOPA or PIPA."
    }
]
